{
    "Shops": [
        {
            "Shop Name": "A KITCHEN",
            "Shop Address": "#01-30",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=A+KITCHEN",
            "Phone Number": "8544 7000",
            "Description": "Serving mostly North-Eastern Chinese cuisine, A Kitchen at Junction 10 is the 3rd outlet in Singapore. Their signature dishes are their Signature Chong Qing Grilled Fish and Cola Spicy Chicken."
        },
        {
            "Shop Name": "APAX MEDICAL & AESTHETICS CLINIC",
            "Shop Address": "#02-11",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=APAX+MEDICAL++AESTHETICS+CLINIC",
            "Phone Number": "6769 6007",
            "Description": "Health is more than just staying physically healthy. A healthy individual can maintain and build fulfilling relationships, cope with the stressors of everyday life and finds purpose and meaning in what they do. At APAX Medical & Aesthetics Clinic, we believe that everyone deserves access to medical treatments to achieve and maintain healthy skin. We deliver services that are competitively priced for everyone."
        },
        {
            "Shop Name": "CAPTAIN KIM KOREAN BBQ & HOTPOT",
            "Shop Address": "#01-24",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=CAPTAIN+KIM+KOREAN+BBQ+%26+HOTPOT",
            "Phone Number": "Not Available",
            "Description": "At Captain Kim, guests can enjoy both Korean BBQ and Hotpot at the same time - a popular choice for company gatherings and with family and friends. Overseen by the ever-stringent Captain Kim, the buffet ingredients on paradewith more than 60 varieties are of top-notch quality, with meats marinated to regimental perfection and refreshing free-flow drinks. When you are craving for adeliciously fresh and yet an affordable buffet, Captain Kim beckons!\n  All ingredients are halal-certified and the restaurant is in the midst of applying for halal certification."
        },
        {
            "Shop Name": "DENTAL FOCUS JUNCTION 10 CLINIC",
            "Shop Address": "#01-06",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=DENTAL+FOCUS+JUNCTION+10+CLINIC",
            "Phone Number": "6769 0389",
            "Description": "Dental Focus (Junction10) was started in Nov 2016 and is part of Dental Focus International Group. The founder of the group is our CEO, Dr Joseph Seow. At Dental Focus International Group, our team is fully dedicated to provide our patients dental solutions that encompass all aspects of dentistry. We provide comprehensive dental wellness and strive to help our patient to achieve that healthy, beautiful smile they deserve. We believe “the world looks beautiful when you are smiling”."
        },
        {
            "Shop Name": "ENCIK TAN",
            "Shop Address": "#01-31A",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=ENCIK+TAN",
            "Phone Number": "6370 1155",
            "Description": "The concept behind Encik Tan came about from the desire to let our Muslim counterparts enjoy popular local Chinese fare. At Encik Tan, you can find halal versions of our signature dishes such as Hainanese Curry Rice, Fishball Noodles and Wanton Noodles. Our outlets are Halal-certified and our food is prepared with Halal ingredients and methods, while retaining its nostalgic flavour and taste."
        },
        {
            "Shop Name": "FATBURGER & BUFFALO'S",
            "Shop Address": "#01-29",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=FATBURGER+%26+BUFFALO%27S",
            "Phone Number": "6235 4535",
            "Description": "An all-American, Hollywood favorite, Fatburger is a fast-casual restaurant serving big, juicy, tasty burgers, crafted specifically to each customer’s liking. With a legacy spanning 70 years, Fatburger’s extraordinary quality and taste inspire fierce loyalty amongst its fan base, which includes a number of A-list celebrities and athletes. Featuring a contemporary design and ambience, Fatburger offers an unparalleled dining experience, demonstrating the same dedication to serving gourmet, homemade, custom-built burgers as it has since 1952 – The Last Great Hamburger Stand™️."
        },
        {
            "Shop Name": "FITNESS FIRST",
            "Shop Address": "#02-01",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=FITNESS+FIRST",
            "Phone Number": "6767 2406",
            "Description": "Ideally situated in Junction 10 Shopping Centre next to Bukit Panjang MRT, Fitness First Junction 10 is a fully equipped state-of-the-art gym. It is a 15,069 square feet fitness haven with a variety of cardio equipment such as LifeFitness resistance machines with free-weight areas, a Freestyle Group Training area and a Group Exercise studio. \n\nFor cycling enthusiasts, we want you to know Fitness First Junction 10 is home to our 'Best in Class' for Spin Class, so join us for a spin! Members can discover their fighting spirit with Muay Fight Pro classes, conducted 4 times weekly. This class beautifully integrates unique Muay Thai characteristics into a freestyle training program, which provides you the closest experience to a real fight! \n\nWith highly qualified personal trainers at hand, we are ready to help our members embark on their fitness journey. We can't wait to see you there."
        },
        {
            "Shop Name": "FOURSKIN OUTLET STORE",
            "Shop Address": "#01-10",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=FOURSKIN+OUTLET+STORE",
            "Phone Number": "6769 1703",
            "Description": "Ladies / kids fashions and accessories"
        },
        {
            "Shop Name": "FUN TOAST",
            "Shop Address": "#01-27",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=FUN+TOAST",
            "Phone Number": "6612 1736",
            "Description": "Serving customers from Breakfast to Dinner, Fun Toast (previously known as Kheng Nam Hong, 琼南芳) was founded in 1941. Fun Toast is a Fun, Innovative and Uniquely Singapore Coffeehouse – moving ahead with time but always keeping in touch with the communities through delectable traditional Nanyang Food and Beverages."
        },
        {
            "Shop Name": "GLOBAL ART",
            "Shop Address": "#02-20",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=GLOBAL+ART",
            "Phone Number": "6767 6220",
            "Description": "Established in the year of 1999, Global Art learning methodology and creative art enrichment programmes have been adopted and implemented throughout the world. Through our innovative programmes, learners learn, grow and develop creatively in a conducive and inspiring learning environment."
        },
        {
            "Shop Name": "HANLIN LANGUAGE SCHOOL",
            "Shop Address": "#02-05",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=HANLIN+LANGUAGE+SCHOOL",
            "Phone Number": "6767 6211 / 6767 0420",
            "Description": "Hanlin Centre was established in 1999, and is registered with the Ministry of Education managed by a team of professionals. Our teachers are highly qualified teachers from Beijing for Chinese Programmes and NIE trained for English and Mathematics. These teachers also have many years of teaching experience."
        },
        {
            "Shop Name": "HIART",
            "Shop Address": "#02-09",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=HIART",
            "Phone Number": "6539 9640",
            "Description": "Kids with confidence to accomplish anything they set their mind to - that's our goal! HiArt is committed to providing high quality fine art instruction that empowers children with essential life skills to achieve success in school and in life.\n  With our curriculum, children not only learn how to draw and paint but also to develop creative problem-solving skills & increase confidence in themselves!"
        },
        {
            "Shop Name": "HOUSE OF TRADITIONAL JAVANESE MASSAGE",
            "Shop Address": "#02-10",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=HOUSE+OF+TRADITIONAL+JAVANESE+MASSAGE",
            "Phone Number": "Not Available",
            "Description": "Javanese massage uses all parts of the hand, including the knuckles, to knead and massage the muscles. It relies upon deep thumb pressures pushing, pressing and circling along and around the body’s energy meridians to break down tensely knotted muscles and to stimulate the body’s lymphatic system into releasing its self-regenerative power. The deep thumb pressure is accompanied with simultaneous stroking palm movements, squeezing and pushing against the skin and veins to improve blood circulation. Usually massage oil is used to facilitate the therapy."
        },
        {
            "Shop Name": "KCUTS",
            "Shop Address": "#01-18",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=KCUTS",
            "Phone Number": "Not Available",
            "Description": "kcuts is a Korean-themed hair salon that provides efficient, hygienic and quality haircuts for everyone at just $12 per session. Providing no-frills hair cut services by professional stylists trained under native Korean hairstylists, customers can enjoy a quick, yet stylish 10-minute haircut at kcuts. Hygiene is not compromised with innovative technology used, such as the air washer to clean away excessive hair for every customer. Have your 10-minute Korean style today!"
        },
        {
            "Shop Name": "KJ OPTOMETRISTS",
            "Shop Address": "#01-19",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=KJ+OPTOMETRISTS",
            "Phone Number": "6910 2288 / 8023 8888",
            "Description": "KJ Optometrists is a team of fully qualified optometrists specializing in primary eye care services. Established in the 1980s, we have since earned ourselves a longstanding reputation among our customers as a company that provides professional and quality eye care services.\n  Our services include prescribing of glasses and contact lenses to the detection of various eye complications e.g. cataracts, glaucoma and age-related macular degeneration through advanced diagnostic equipment."
        },
        {
            "Shop Name": "KUMON",
            "Shop Address": "#02-08",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=KUMON+",
            "Phone Number": "6760 3911",
            "Description": "Kumon is the world’s leading after-school enrichment programme. In Singapore, we offer Language & Math Programmes at over 70 centres across the island.\n\nKumon is located in 60 countries and regions, with more than 4 million students enrolled in over 7,500 Kumon centres.\n\nIn Singapore, we offer English, Chinese & Mathematics Programmes at over 70 centres across the island. "
        },
        {
            "Shop Name": "LIHO TEA",
            "Shop Address": "#01-26",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=LIHO+TEA",
            "Phone Number": "6465 2130",
            "Description": "LiHO is Singapore's first home grown freshly brewed tea brand and first to introduce Cheese Tea to the market. LiHO 里喝 means, “how are you?” in the Chinese dialect – Hokkien and what we want to show is that despite the differences in language and culture among different races in Singapore, a simple greeting of LiHO! can bond us together and that is what LiHO signify – a proud Singapore tea beverage brand that every Singaporean can relate to. All our teas and beverages are brewed daily onsite, at all LiHO outlets. As a homegrown Singapore brand, our aim is to grow the tea drinking culture."
        },
        {
            "Shop Name": "MINDCHAMPS PRESCHOOL",
            "Shop Address": "#02-15",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=MINDCHAMPS+PRESCHOOL",
            "Phone Number": "6767 2381",
            "Description": "Here at MindChamps PreSchool @ Junction 10, our dedicated team of teachers, principal and directors are qualified and will assure you that we will enhance and strengthen every child’s own natural learning abilities. We will help each child establish a positive relationship with the learning experience, so that this positive and creative mindset becomes a part of their learning experiences for life."
        },
        {
            "Shop Name": "MR. D.I.Y.",
            "Shop Address": "#02-02",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=MR+DIY",
            "Phone Number": "8540 8552",
            "Description": "MR.DIY is a home-grown enterprise from Malaysia. The home improvement retailer stores offer a wide selection of — approximately 14,900 SKUs — across 5 major categories, namely hardware; household and furnishing; electrical; stationery and sports equipment products; and others (comprising toys, car accessories, jewellery and cosmetics). The company strives to always put customers first, providing a wide variety of products, good quality, value-for-money and “ALWAYS LOW PRICES”."
        },
        {
            "Shop Name": "NEW LIFE CHILDCARE",
            "Shop Address": "#04-02",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=NEW+LIFE+CHILDCARE",
            "Phone Number": "Not Available",
            "Description": ""
        },
        {
            "Shop Name": "NUH CHILDREN'S URGENT CARE CLINIC @ BUKIT PANJANG",
            "Shop Address": "#01-22",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=NUH+CHILDREN%27S+URGENT+CARE+CLINIC+%40+BUKIT+PANJANG",
            "Phone Number": "6219 1538",
            "Description": "The NUH Children’s Urgent Care Clinic @ Bukit Panjang is a walk-in clinic in the community for children and adolescents up to 18 years old with urgent but non-life-threatening conditions. Open daily with extended hours, the clinic offers a range of services including basic blood tests."
        },
        {
            "Shop Name": "NUHEALTH MEDICAL CENTRE",
            "Shop Address": "#01-23",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=NUHEALTH+MEDICAL+CENTRE",
            "Phone Number": "6219 9298",
            "Description": "NuHealth Medical Centre is run by a team of trained doctors, experienced in providing clinical care for both acute and chronic medical conditions in children and adults, including infants, toddlers and the elderly. Other services available include vaccinations, general health screening, pap smears, check-ups for employment/driving licences/domestic helpers, and even minor surgery such as suturing for cuts, ingrown toe-nail avulsions and excision of small lumps."
        },
        {
            "Shop Name": "O.H EYE",
            "Shop Address": "#01-16",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=OH+EYE",
            "Phone Number": "8820 8072",
            "Description": "O.H Eye is a lifestyle retail store selling spectacles and sunglasses at affordable prices."
        },
        {
            "Shop Name": "OODLES LEARNING",
            "Shop Address": "#02-12",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=OODLES+LEARNING",
            "Phone Number": "6909 7723 / 8298 2280",
            "Description": "At Oodles Learning, we conduct quality and proven programmes by onSponge - the developer and propriety owner of the renowned + thinkingMath programme with workbooks used in more than 100 local schools."
        },
        {
            "Shop Name": "OSSIA MUSIC SCHOOL",
            "Shop Address": "#02-17",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=OSSIA+MUSIC+SCHOOL",
            "Phone Number": "3158 3391",
            "Description": "Ossia Music School welcomes all aspiring musicians at Junction 10! We provide piano, violin, drums, guitar, ukulele, keyboard lessons, and all our courses are structured and standardised to ensure the highest quality and the best learning experience for our students. Our lessons are carefully designed to tailor to each individual’s learning needs. We are proud to have a team of lively, engaging and dedicated teachers, who are passionate to share the joys of music with you as you embark on your musical journey with Ossia."
        },
        {
            "Shop Name": "PENYET TOWN",
            "Shop Address": "#01-31",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=PENYET+TOWN",
            "Phone Number": "6760 9790",
            "Description": "Penyet Town Authentic Indonesian Restaurant is famous for its delicious Ayam Penyet (Smashed Fried Chicken). Try a whole variety of other smashing dishes such as Iga Penyet (Smash Beef Ribs) or Udang Penyet (Smashed Fried Prawns). Wide range of menu options at affordable prices with a cozy and comfortable dining ambience."
        },
        {
            "Shop Name": "PET LOVERS CENTRE",
            "Shop Address": "#01-01",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=PET+LOVERS+CENTRE",
            "Phone Number": "6776 0273",
            "Description": "Pet Lovers Centre (PLC) is Southeast Asia's largest pet care retail chain with 160 stores strategically located in Singapore, Malaysia, Thailand, the Philippines and Vietnam. We carry the widest range of pet products, from food to accessories, for all kinds of animal companions. PLC also offer quality pet services including pet grooming, veterinary consultations, online shopping, home delivery and a team of Pet Care Consultants ready to answer the customer's questions regarding their pets!"
        },
        {
            "Shop Name": "PIZZABOY",
            "Shop Address": "#01-03",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=PIZZABOY",
            "Phone Number": "6904 3887",
            "Description": "Pizzaboy was born and made in Singapore and started it's humble beginnings in 2016. Our aim is to produce classic and local pizza flavours in good quality and affordable prices - so that more people can enjoy pizzas without breaking their wallets! Pizzaboy is also Halal certified by MUIS and with vegetarian options to make sure everybody can enjoy our \"shiok\" pizzas at your gatherings."
        },
        {
            "Shop Name": "PLAYFACTO SCHOOL",
            "Shop Address": "#02-18",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=PLAYFACTO+SCHOOL",
            "Phone Number": "9832 2996",
            "Description": "PlayFACTO School @ Junction 10 was conceptualised to meet working families’ demand for premium, reliable student care services near Bukit Panjang & Choa Chu Kang. Our unique Positive Education approach and vibrant Reggio-inspired learning environment provide students with engaging experiences that develop them holistically, balancing between academic excellence and social-emotional learning within a home-like environment. Students are encouraged to discover and develop their interests and creativity, learn critical soft skills, acquire positive attitudes and enhance their social interactions with peers."
        },
        {
            "Shop Name": "ROTIKEK",
            "Shop Address": "#01-20",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=ROTIKEK",
            "Phone Number": "6686 5728",
            "Description": "Coming from a family of bakers, our managing Director Ken has had more than 20 years of baking experience in the pastry industry, honing his baking skills & prowess through working as a pastry chef in numerous bakeries since 1991. His wife, May, was raised in a family that owned a snacks processing business, is also well versed with the knowledge of food quality. With their combined background, quality control of Bakery Cuisine’s line of products comes instinctively as priority to the business, as they ensure all supplies and ingredients are freshest; including those they import from Taiwan."
        },
        {
            "Shop Name": "SHENG SIONG SUPERMARKET",
            "Shop Address": "#01-07",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=SHENG+SIONG+SUPERMARKET",
            "Phone Number": "6219 3106",
            "Description": "Sheng Siong Group Ltd is one of Singapore’s largest retailers with over 60 stores located all across the island. Our stores are designed to provide customers with both “wet and dry” shopping options ranging from a wide assortment of live, fresh and chilled produce, such as seafood, meat and vegetables to packaged, processed, frozen and preserved food products as well as general merchandise, including toiletries and essential household products. Over the past decade, we have begun developing a selection of housebrands to offer our customers quality alternatives to national brands at substantial savings. "
        },
        {
            "Shop Name": "SHI LI FANG",
            "Shop Address": "#01-32",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=SHI+LI+FANG",
            "Phone Number": "6870 8896",
            "Description": "Shi Li Fang is a hotpot restaurant chain that offers a wide spread of food choices at affordable prices. Adding practicality to affordability, Shi Li Fang even offers one-person hotpot sets, allowing convenient dine alone experiences for individuals who wish to get a quick meal and satisfy a hotpot craving. Shi Li Fang features 9 soup bases: Ravishing Tomato Soup, Specialty Mala Soup, Tonic Chicken Soup, Beauty Collagen Chicken, Nourishing Fish, Tasty Pickled Vegetables, Vegetarian, Japanese-style Pork Bone and Tasty Mushroom Soup. The delicious soups are accompanied by a selection of meats and 20 different types of dipping sauces and garnishes. To date, the hotpot restaurant chain has 15 outlets across Singapore.If you’re interested in a steamboat experience that is both affordable and unique, come by Shi Li Fang and create a taste that scores with your taste buds!"
        },
        {
            "Shop Name": "SIAM SQUARE MOOKATA",
            "Shop Address": "#01-33",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=SIAM+SQUARE+MOOKATA",
            "Phone Number": "8826 1919",
            "Description": "“Mookata” loosely translates to “Moo” as Thai Pork and “Kata” as Skillet. It originated from Northern Thailand and is firing up the Thai Barbeque Steamboat scene in Singapore these recent years. SIAM SQUARE MOOKATA (SSM) is considered one of the few pioneer MOOKATA Restaurant in Singapore. Their main outlet at Havelock Road opened its doors on June 21 2013, and has since expanded to several other outlets within a few months with its latest at Junction 10."
        },
        {
            "Shop Name": "SOGDO KOREAN",
            "Shop Address": "#01-02",
            "Shop URL": "https://www.fareastmalls.com.sg/en/junction-10/shops/shop?shopName=SOGDO+KOREAN",
            "Phone Number": "9786 9708",
            "Description": "Sogdo Korean is a Korean takeaway food stall concept aiming to serve cheap, tasty and quick Korean food. Be sure to try out their signature Bibimbap or BBQ meat bowls!"
        }
    ]
}